{"pageProps":{"postData":{"id":"brag_doc_2024","contentHtml":"<h2><strong>Goals for this year</strong></h2>\n<ul>\n<li>[ ] Take on at least one public speaking engagement</li>\n<li>[x] Gain Software/System Design skills through either real-life experience or\nmuch study</li>\n<li>[x] Build more scripts and tools</li>\n<li>[x] Expand my skillset to two new languages, libraries, or tools</li>\n<li>[x] Maintain (and possibly deepen) my lesser-used skills in the JS/TS\necosystem</li>\n</ul>\n<h1><strong>Projects</strong></h1>\n<h2>Tech E&#x26;O Dynamic Applications Project</h2>\n<ul>\n<li><strong>Spearheaded a strategic initiative</strong> to transition insurance application questions from static to dynamic, starting with Tech E&#x26;O. This project was critical to enabling customized insurance products, directly impacting business agility and the ability to enter new markets faster.</li>\n<li><strong>Drove the architectural vision</strong> by creating the initial design, facilitating cross-team architectural discussions, and presenting multiple options with clear trade-offs to leadership. My ability to build consensus and \"disagree and commit\" ensured the project moved forward with full business alignment, even when the final direction differed from my initial proposal.</li>\n<li><strong>Led the technical execution</strong>, integrating our document services with the <code>exec-risks-backend</code> under tight deadlines. This involved navigating a complex and unfamiliar codebase and personally implementing a significant portion of the core logic, ensuring we delivered a high-quality solution on time.</li>\n<li><strong>Championed and executed a critical cross-team refactor</strong> to centralize Protobuf definitions. I identified inconsistencies in the <code>exec-risks-backend</code> and led the effort to centralize protos across several services, reducing code duplication and simplifying future integrations. This has become the new best practice for services in our domain.</li>\n</ul>\n<h2>Policy Validator Service</h2>\n<ul>\n<li><strong>Leadership Role in Service Creation:</strong>\n<ul>\n<li>Successfully took ownership of the service, building upon its foundation and\nenhancing its capabilities, demonstrating initiative and problem-solving\nskills.</li>\n<li>Demonstrated initiative and problem-solving skills by optimizing and\nextending the service beyond its initial scope.</li>\n</ul>\n</li>\n<li><strong>Expanding the Work and Reducing Noise:</strong>\n<ul>\n<li>Collaborated with key stakeholders and product teams to deliver meaningful\nmetrics and safeguards, showcasing strong collaboration and communication\nskills.</li>\n<li>Achieved higher coverage than promised within the quarter (60% promised, 70%\ndelivered), showcasing dependability and over-delivering on objectives,\nillustrating dependability and an ability to exceed expectations.</li>\n</ul>\n</li>\n<li><strong>Identifying and Addressing System Issues:</strong>\n<ul>\n<li>Exposed several key issues, bugs, and gaps, leading to the creation of a\nmulti-team project to address these problems, highlighting strong analytical\nand teamwork skills.\n<ul>\n<li>Worked through adversity to actually still deliver key goals</li>\n</ul>\n</li>\n<li>Gathered data and worked with a senior developer to better categorize and\naddress these issues, illustrating strong analytical and teamwork skills.\n<ul>\n<li>(Naming is one of the two hardest things in SWE 😉)</li>\n</ul>\n</li>\n</ul>\n</li>\n</ul>\n<h3><strong>Impact</strong></h3>\n<ul>\n<li>Increased system reliability and performance by identifying and resolving\ncritical issues.</li>\n<li>Fostered cross-team collaboration and improved overall service quality.</li>\n<li>Enhanced project leadership and strategic problem-solving abilities.</li>\n</ul>\n<h2><strong>Template Management Refactor</strong></h2>\n<ul>\n<li><strong>Refactoring and Renaming:</strong>\n<ul>\n<li>Heavily refactored the template management logic, renaming the\n\"dynamoregistry\" to \"template management\" to provide a new framework for\ngrouping related functionality, showcasing initiative and strategic\nthinking.</li>\n<li>Split out logic for the local cache and DynamoDB (DDB) calls into separate\nproviders by creating an abstract class, demonstrating strong design skills\nand modularity.</li>\n</ul>\n</li>\n<li><strong>Efficiency and Performance Improvements:</strong>\n<ul>\n<li>Improved DDB queries and scans by avoiding full table scans and introducing\ndirect item queries, significantly enhancing the tool's performance and\nefficiency.</li>\n<li>Developed a concept of a <code>search_key</code> for more refined scans, increasing the\nsystem's responsiveness and search functionality.</li>\n<li>Extended search capabilities to include fuzzy search and filtering by\nvarious attributes such as market, line, and other configurable fields,\npaving the way for future performance enhancements.</li>\n</ul>\n</li>\n<li><strong>Real-Time Updates and Synchronization:</strong>\n<ul>\n<li>Ensured updates or creations in DDB are immediately saved and synced across\ninstances, maintaining the health of the document management tool during\ndeployments.</li>\n<li>Improved system scalability by transitioning from a single instance to\nmultiple instances, allowing as many instances as needed.</li>\n<li>Enhanced system stability by eliminating the dependency on full table scans\nand improving cache reliability.</li>\n</ul>\n</li>\n</ul>\n<h3><strong>Impact</strong></h3>\n<ul>\n<li><strong>Enhanced Performance:</strong>\n<ul>\n<li>Reduced the need for full table scans, significantly speeding up the doc\nmanagement tool.</li>\n</ul>\n</li>\n<li><strong>Scalability:</strong>\n<ul>\n<li>Successfully transitioned from a single instance to multiple instances,\nproviding the ability to scale out as needed.</li>\n</ul>\n</li>\n<li><strong>Improved System Health:</strong>\n<ul>\n<li>Ensured real-time synchronization across instances, reducing system downtime\nduring deployments.</li>\n</ul>\n</li>\n<li><strong>Increased Modularity and Maintainability:</strong>\n<ul>\n<li>Made the logic more modular and easier to maintain by separating concerns\ninto different providers.</li>\n</ul>\n</li>\n<li><strong>New Framework Implementation:</strong>\n<ul>\n<li>Provided a new paradigm for thinking about and grouping functionality,\nenhancing the clarity and strategic direction of the system.</li>\n</ul>\n</li>\n<li><strong>Advanced Search Capabilities:</strong>\n<ul>\n<li>Enabled fuzzy search and customizable filtering, increasing search\nefficiency and flexibility.</li>\n</ul>\n</li>\n</ul>\n<h2>Replay Service</h2>\n<ul>\n<li><strong>Implementation and Testing:</strong>\n<ul>\n<li>Implemented a smoke/regression testing system with PE, improving the\nsystem's reliability and robustness through technical expertise.</li>\n<li>Took significant ownership of infrastructure work, system debugging, and\ncodebase contributions, demonstrating a deep technical expertise.</li>\n</ul>\n</li>\n<li><strong>Process Design and Training:</strong>\n<ul>\n<li>Designed an effective testing process and successfully trained other team\nmembers, showing strong teaching and leadership abilities.</li>\n<li>Ensured minimal introduction of new bugs and improved testing\ncomprehensiveness.</li>\n</ul>\n</li>\n<li><strong>Frontend Modernization:</strong>\n<ul>\n<li>Successfully migrated frontend from Jinja to React</li>\n<li>Established new repository following company best practices</li>\n<li>Implemented modern development tools and practices:\n<ul>\n<li>Integrated pnpm for significantly improved local development speed</li>\n<li>Adopted tanstack-query for efficient data management</li>\n<li>Developed custom hooks and optimized React Context usage</li>\n</ul>\n</li>\n<li>Created foundation for modernizing older frontend applications</li>\n<li>Enhanced developer experience through improved tooling</li>\n</ul>\n</li>\n</ul>\n<h3><strong>Impact</strong></h3>\n<ul>\n<li>Increased system reliability with thorough smoke and regression testing.</li>\n<li>Elevated team productivity and code quality through structured training and\nrobust testing frameworks.</li>\n<li>Demonstrated leadership and mentorship by guiding teammates through complex\ntechnical processes.</li>\n</ul>\n<h2>Document Management Tool Improvements</h2>\n<ul>\n<li><strong>User Experience Enhancements:</strong>\n<ul>\n<li>Improved the user interface by allowing users to customize which subsections\nthey see in the conditions section, enhancing ease of use and user\nsatisfaction.</li>\n<li>Introduced customizable preferences for the conditions and main templates\npage. Users can now select and order columns based on their needs.</li>\n<li>Expanded the variety of columns available, including market, line, and\nassignment status, improving the visibility of critical information.</li>\n</ul>\n</li>\n<li><strong>Collaboration and Feedback:</strong>\n<ul>\n<li>Actively collaborated with doc-support users to gather and understand their\nneeds and preferences, ensuring the tool improvements were user-centric.</li>\n<li>Responded promptly to user feedback and bugs during the rollout, addressing\nissues within minutes, and showcasing responsiveness and customer focus.</li>\n</ul>\n</li>\n<li><strong>Enhanced Document Version Control:</strong>\n<ul>\n<li>Implemented rollback endpoint for files, enabling version control in S3</li>\n<li>Created endpoint for retrieving file versions and visual diff capabilities</li>\n<li>Navigated S3 versioning constraints to implement a robust solution</li>\n<li>Added critical document management features that improved service\ncapabilities</li>\n<li>Assisted doc support engineers with large PRs during company logo rollout</li>\n</ul>\n</li>\n</ul>\n<h3><strong>Impact</strong></h3>\n<ul>\n<li>Enhanced usability and user satisfaction by facilitating quicker and easier\naccess to important information.</li>\n<li>Improved user efficiency and customization options, leading to a more\nproductive workflow for doc-support users.</li>\n<li>Demonstrated strong collaboration, communication, and responsiveness skills,\nensuring ongoing user engagement and improvement.</li>\n</ul>\n<h2><strong>Docgen Service Latency Improvement</strong></h2>\n<ul>\n<li><strong>Problem Identification and Collaboration:</strong>\n<ul>\n<li>Noticed significant latency issues in the main service, Docgen, which caused\nus to be way out of our SLO and significantly increased our burn rate.</li>\n<li>Collaborated with a senior engineer who initially provided possible sources\nof the latency problem.</li>\n</ul>\n</li>\n<li><strong>Investigation and Analysis:</strong>\n<ul>\n<li>Took ownership of the issue while the senior engineer was away,\ninvestigating the suggested issues using logs and traces in Datadog.</li>\n<li>Maintained ongoing communication with two Principal Engineers (PEs), sharing\ninsights and collaborating on potential solutions.</li>\n</ul>\n</li>\n<li><strong>Solution Implementation:</strong>\n<ul>\n<li>Identified that reloading the local cache every minute was causing the\nlatency.</li>\n<li>Proposed and implemented a quick solution to update the cache only on\nchanges, leveraging my recent work on the caching mechanism and the new\nsystem for capturing snapshots of our database.</li>\n<li>Implemented a mechanism where the cache would check the snapshot ID and\nreload only if it had changed.</li>\n</ul>\n</li>\n</ul>\n<h3><strong>Impact</strong></h3>\n<ul>\n<li>Successfully restored our SLOs and significantly reduced latency, as evidenced\nby several graphs:\n<ul>\n<li>Reload time was reduced from several seconds to mostly 0s, with mere\nmilliseconds on actual reloads.</li>\n<li>The percentage of calls over 1s dropped from 30% to 10%, improving overall\nperformance.</li>\n</ul>\n</li>\n<li>Also fixed a longstanding memory issue, leading to a dramatic drop in memory\nusage.</li>\n</ul>\n<h2><strong>TRIA Free Offering Project</strong></h2>\n<ul>\n<li><strong>Leadership and Coordination:</strong>\n<ul>\n<li>Led a high-profile, customer-facing project to offer TRIA for free in a\nspecific market for our internal carrier.</li>\n<li>Coordinated with multiple teams and stakeholders, managing several setbacks,\nincluding requirements clarifications and carrier approvals.</li>\n</ul>\n</li>\n<li><strong>Handling Legacy Policies:</strong>\n<ul>\n<li>Managed the complexity of older policies and determined required behavior,\nleading to the identification and resolution of several bugs.</li>\n<li>Collaborated closely with different teams to get engineering questions\nanswered and disseminated information effectively.</li>\n</ul>\n</li>\n<li><strong>Cross-Team Collaboration:</strong>\n<ul>\n<li>Facilitated inter-team communication, ensuring that developers from various\nteams were aligned.</li>\n<li>Specifically addressed a front-end issue where older policies were not\naccounted for, and worked with the front-end team to resolve it.</li>\n<li>Quickly directed the resolution of bugs and ensured that customer issues\nwere promptly handled.</li>\n</ul>\n</li>\n<li><strong>Process Improvement:</strong>\n<ul>\n<li>Introduced new processes for more effective project management, such as\nclear launch documents with specified dates and sign-offs, inspired by best\npractices from senior developers.</li>\n</ul>\n</li>\n</ul>\n<h3><strong>Impact</strong></h3>\n<ul>\n<li><strong>Simplified User Experience:</strong>\n<ul>\n<li>Eliminated the need for policyholders to accept or reject TRIA with a\nsignature, reducing hassle and streamlining the onboarding experience.</li>\n<li>Updated internal tools to remove prompts for TRIA acceptance or rejection,\nspeeding up the policy issuance workflow.</li>\n</ul>\n</li>\n<li><strong>Benefits for Brokers:</strong>\n<ul>\n<li>Enabled a smoother and simpler policy setup for brokers by removing the need\nfor an additional onboarding discussion point.</li>\n<li>Promoted consistent TRIA offerings across all US Cyber policies, enhancing\nthe user experience.</li>\n</ul>\n</li>\n<li><strong>Improved Policy Documentation:</strong>\n<ul>\n<li>Updated policy documents (Quotation, Binder, Declarations) to no longer show\nTRIA charges, and revised marketing jackets to reflect this change.</li>\n</ul>\n</li>\n<li><strong>Operational Efficiency:</strong>\n<ul>\n<li>Simplified policy issuance workflows, allowing the servicing team to avoid\nTRIA-specific handling processes.</li>\n</ul>\n</li>\n</ul>\n<h1><strong>Collaboration &#x26; Mentorship</strong></h1>\n<h2><strong>Collaboration</strong></h2>\n<h3><strong>Designated Go-to Expert</strong></h3>\n<ul>\n<li>The Documents and doc-support teams regularly seek my expertise on\nGolang-related issues and questions.</li>\n<li>As the subject matter expert (SME) for infrastructure within the Documents\nteam, I guide engineers of all levels—from P2 to senior—on setting up\nTerraform and Terragrunt files.</li>\n<li>Demonstrated strong mentorship and knowledge sharing:\n<ul>\n<li>Helped doc support engineers with large PRs during logo rollout</li>\n<li>Provided rapid response to bug reports and feature requests</li>\n<li>Assisted with giant PRs for the docx_formatter project</li>\n<li>Provided mentoring support to doc-support engineers, fostering their growth\nand development</li>\n<li>Shared React and modern frontend development best practices</li>\n<li>Led by example in improving documentation and developer workflows</li>\n</ul>\n</li>\n</ul>\n<h3><strong>Mentorship and Co-Contributor Role in Design Docs</strong></h3>\n<ul>\n<li><strong>Consulted PE and Senior Engineer on Multiple Projects</strong>\n<ul>\n<li>Mentored other developers, including guiding P3 engineers through a downturn\nand helping them relate to other team members.</li>\n<li>Co-contributed to design docs and consulted with PE and a Senior Engineer on\nmultiple projects.</li>\n</ul>\n</li>\n<li>Push for more documentation and formalization of design decisions</li>\n</ul>\n<h3>Cross-Team Technical Leadership</h3>\n<ul>\n<li>Tech E&#x26;O Project Leadership:\n<ul>\n<li>Created a comprehensive initial design document</li>\n<li>Demonstrated adaptability by pivoting based on senior principal engineer\nfeedback</li>\n<li>Developed and presented multiple architectural options with clear trade-offs</li>\n<li>Successfully integrated with exec-risks-backend despite architectural\ndifferences</li>\n<li>Led proto file centralization initiative across multiple services</li>\n<li>Completed complex refactoring work in external team repositories</li>\n<li>Facilitated smooth handoff to exec-risks team under tight deadlines</li>\n</ul>\n</li>\n</ul>\n<h3><strong>Document Management Tool Collaboration</strong></h3>\n<ul>\n<li>Worked closely with doc-support users to understand their requirements, gather\nfeedback, and implement improvements.</li>\n<li>Maintained rapid response times to user feedback and bug reports during the\nrollout phase.</li>\n</ul>\n<h3><strong>General Recognition</strong></h3>\n<ul>\n<li>Consistently recognized by a Principal Engineer for exceptional responsiveness\nand quick fixes for any and all bugs:\n<ul>\n<li>\"Thanks for always being so quick to make fixes and investigate things!\"\n(Jim Kelly)</li>\n<li>Multiple instances where the PE has been impressed by the speed and quality\nof the fixes delivered, underscoring my reliability and dedication to\nquality.</li>\n</ul>\n</li>\n<li>Actively collaborated with teammates and stakeholders across projects,\nensuring timely communication and effective problem-solving.</li>\n</ul>\n<h3><strong>Docgen Service Latency Improvement</strong></h3>\n<ul>\n<li>Collaborated closely with a senior engineer and two Principal Engineers to\ndiagnose and resolve significant latency issues in the Docgen service.</li>\n<li>Maintained clear and ongoing communication throughout the process, ensuring\nalignment and timely updates.</li>\n</ul>\n<h3><strong>TRIA Coverage Offering Project</strong></h3>\n<ul>\n<li>Led cross-functional collaboration involving multiple teams to successfully\nlaunch the TRIA coverage offering.</li>\n<li>Managed and resolved issues related to older policies, coordinating with\nvarious teams to ensure engineering questions were answered and solutions were\ndisseminated.</li>\n<li>Promoted better communication and project management practices, such as clear\nlaunch documents with specified dates and sign-offs.</li>\n<li>Addressed frontend issues regarding older policies and worked with the\nfrontend team to resolve them, ensuring a seamless user experience.</li>\n</ul>\n<h2>Foundational Code</h2>\n<h3><strong>Refactoring and Documentation</strong></h3>\n<ul>\n<li>Refactored the main service code to improve readability and functionality,\nintroduced better testing, and added comprehensive docstrings.</li>\n<li>Created foundational code for the Policy-Validator service, including\nstructure and best practices.</li>\n<li>Improved several CI systems and developer workflows.</li>\n</ul>\n<h3>Infrastructure and Developer Experience</h3>\n<ul>\n<li>Improved repository documentation and developer onboarding:\n<ul>\n<li>Enhanced READMEs with comprehensive documentation</li>\n<li>Optimized makefile commands for better workflow efficiency</li>\n<li>Improved docker compose configuration with network additions</li>\n<li>Streamlined and accelerated CI processes</li>\n</ul>\n</li>\n</ul>\n<h1><strong>Design &#x26; Documentation</strong></h1>\n<h2>Design Docs</h2>\n<ol>\n<li>Wrote design docs for Tech E&#x26;O project—how the new integrations can work with\ntradeoffs for each</li>\n</ol>\n<h2>Documentation</h2>\n<ol>\n<li>Heavily improved READMEs in all repos owned</li>\n</ol>\n<h1><strong>What you learned</strong></h1>\n<h2>Concepts and Books</h2>\n<p>Read several books:</p>\n<p>| Title                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                | Key Takeaways                                                                            |\n| -------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------- | ---------------------------------------------------------------------------------------- |\n| <a href=\"https://www.amazon.com/Software-Architecture-Trade-Off-Distributed-Architectures/dp/B0CFVZTP97/ref=sr_1_1?crid=3VJVFOSGY0TYC&#x26;dib=eyJ2IjoiMSJ9.nqwcn_XNPa_qE3lv1ItCHuquH-d-we8afmACcFRM2iVPGLrXG8pabq3AK0WcAKNLKeqffIIoQ8uatP9joAkMmi8U6Hd0FGowSStBZy8JEXoTbiLthPBGhkPYFwtXQvsFoPd7dS7DsxJ2cSbwqY2vxhv2gQ_qi2JJWiwrqugwS7Khwsi8zBG2_yq1X0M1mhBh3JS1sA8pJ8jK2Xk_KT_8rTqlIfM_gzVddqa8ZmVflPs.S_xkGKjKMp23PPHiOQ1OUG42zPDY1CvuipoyDPNIXOE&#x26;dib_tag=se&#x26;keywords=software+architecture+the+hard+parts&#x26;qid=1717343103&#x26;sprefix=software+ar%2Caps%2C127&#x26;sr=8-1\">Software Architecture: The Hard Parts</a>                        | Does a great job explaining complex issues, though the narrative tone falls short.       |\n| <a href=\"https://www.amazon.com/Fundamentals-Software-Architecture-Engineering-Approach/dp/B08X8H15BW/ref=sr_1_4?crid=3VJVFOSGY0TYC&#x26;dib=eyJ2IjoiMSJ9.nqwcn_XNPa_qE3lv1ItCHuquH-d-we8afmACcFRM2iVPGLrXG8pabq3AK0WcAKNLKeqffIIoQ8uatP9joAkMmi8U6Hd0FGowSStBZy8JEXoTbiLthPBGhkPYFwtXQvsFoPd7dS7DsxJ2cSbwqY2vxhv2gQ_qi2JJWiwrqugwS7Khwsi8zBG2_yq1X0M1mhBh3JS1sA8pJ8jK2Xk_KT_8rTqlIfM_gzVddqa8ZmVflPs.S_xkGKjKMp23PPHiOQ1OUG42zPDY1CvuipoyDPNIXOE&#x26;dib_tag=se&#x26;keywords=software+architecture+the+hard+parts&#x26;qid=1717343103&#x26;sprefix=software+ar%2Caps%2C127&#x26;sr=8-4\">Fundamentals of Software Architecture: An Engineering Approach</a> | More approachable than Kleppmann's DDIA, and very detailed and clear about key concepts. |\n| <a href=\"https://www.amazon.com/Staff-Engineers-Path-Individual-Contributors/dp/B0C7SFBXW3/ref=sr_1_1?crid=1KQ7WS2D9IWSU&#x26;dib=eyJ2IjoiMSJ9.Ce1SzKnc3Sb5-pmrQqWRASiiHSwXA7JkAQ0a6fSin5nsDUeqEBWEeSrOgPb_xP8qU2E_9cVqn6tOyn1U_MGMxGYQ1ijcPoJmUylpoNHIR7ObUvrtfG65sJjtDSSnF_-yvDzw5iyxcSG8qIoBYeuXFrlr9ZNh7ne2mUAZtnKl4zpsUUWkqgBvOe5XWnABPV6H.q3XxM5qPSY1XnAzS8yB7fNdDozhNHCJhp2Fz1NnKsc8&#x26;dib_tag=se&#x26;keywords=the+staff+engineer%27s+path&#x26;qid=1717343263&#x26;sprefix=the+staff+%2Caps%2C134&#x26;sr=8-1\">The Staff Engineer's Path</a> by Tanya Reilly                                                                                      | Provides helpful advice and practical ways to think and act like a staff engineer.       |\n| <a href=\"https://www.amazon.com/Good-Strategy-Bad-Strategy-audiobook/dp/B07R6XQ8YP/ref=sr_1_1?crid=MFOSN0MFEAFU&#x26;dib=eyJ2IjoiMSJ9.pu2RnrPwHBgFS3mog_UaLTtW-J5n87Z9rEo70pFbaq9KYMwU-Jbrn0sGopVEGFO2MufHMw6fyx00rqCw3DnS8S3KEG0zXjhxfLRf6qcWpynj_FLape5cWHbp7kxEd0cp7eJH6xc0JKshrm8K50d0-CuvPJf59bo1X5U2JWtq4J9uJN9y60i6fS1sYdxK4RCFY0X7p9pchQiOttCWwA2qHmk0ltLXdQEZHmPOoVK5i3U.0o5FvlAfrAgjj2kzrz78j6_JRV-SWj5i3ed0KSjnCeI&#x26;dib_tag=se&#x26;keywords=good+strategy+bad+strategy&#x26;qid=1717343422&#x26;sprefix=good+str%2Caps%2C116&#x26;sr=8-1\">Good Strategy / Bad Strategy: The Difference and Why it Matters</a>                                 | A simple but mind-blowing idea that changed my perspective on a fundamental concept.     |</p>\n<p>Concepts:</p>\n<ul>\n<li>Deep dive into TDD</li>\n<li>Deep dive into programming paradigms</li>\n<li>Dependency Injection (DI).</li>\n</ul>\n<h2>Libraries and Tools</h2>\n<ul>\n<li>Gained expertise in modern frontend development tools:\n<ul>\n<li>Implemented pnpm for significantly improved local development speed</li>\n<li>Mastered tanstack-query for efficient data management</li>\n<li>Developed custom React hooks and context patterns</li>\n<li>Learned advanced S3 versioning and management</li>\n</ul>\n</li>\n<li>Deep dived into Bash\n<ul>\n<li>Moved beyond basic features of bash to more advanced features</li>\n<li>Created several more user-friendly bash scripts</li>\n<li>Practiced better error handling and responses in bash scripts</li>\n<li>I learned a lot of cool tricks from\nhttps://www.youtube.com/@yousuckatprogramming</li>\n</ul>\n</li>\n</ul>\n<h1><strong>Outside of work</strong></h1>\n<h2>Blog posts</h2>\n<p><a href=\"https://medium.com/@david-nagarpowers/programming-paradigms-82b14ebe9c5f?source=your_stories_page-------------------------------------\">Programming Paradigms</a></p>\n"}},"__N_SSG":true}