{"pageProps":{"postData":{"id":"brag_doc_2025","contentHtml":"<h2><strong>Goals for this year</strong></h2>\n<ul>\n<li>[ ] Take on at least one public speaking engagement</li>\n<li>[ ] Gain Software/System Design skills through either real-life experience or\nmuch study</li>\n<li>[ ] Build more scripts and tools</li>\n<li>[ ] Expand my skillset to two new languages, libraries, or tools</li>\n<li>[ ] Maintain (and possibly deepen) my lesser-used skills in the JS/TS\necosystem</li>\n</ul>\n<h1><strong>Projects</strong></h1>\n<h2>Tech E&#x26;O Dynamic Applications Project</h2>\n<ul>\n<li><strong>Leadership and Initiative:</strong>\n<ul>\n<li>Led the initiative to make application questions dynamic rather than static,\nstarting with Tech E&#x26;O questions as the first milestone</li>\n<li>Created a comprehensive initial design document and demonstrated\nadaptability by pivoting based on senior principal engineer feedback</li>\n<li>Facilitated discussions between multiple teams to understand needs and\nperspectives</li>\n<li>Developed and presented multiple architectural options with clear\ntrade-offs, enabling informed business decisions</li>\n<li>Demonstrated ability to \"disagree and commit\" by supporting an option\ndifferent from the initial preference</li>\n</ul>\n</li>\n<li><strong>Technical Implementation:</strong>\n<ul>\n<li>Integrated document services with Application Service within\nexec-risks-backend</li>\n<li>Successfully navigated challenges of working with exec-risks' unique code\nstructure and application format</li>\n<li>Developed solutions within tight business deadlines while maintaining code\nquality</li>\n<li>Led and implemented many of the required changes personally</li>\n</ul>\n</li>\n<li><strong>Cross-Team Collaboration:</strong>\n<ul>\n<li>Identified discrepancies in proto file centralization for exec-risks-backend</li>\n<li>Took the initiative to refactor custom Go files and push for a centralized\napproach</li>\n<li>Worked closely with exec-risks team to refactor their custom methods on\ngenerated Go structs</li>\n<li>Led the effort to centralize proto files across several services</li>\n<li>Became a core engineer advocating for proto file centralization best\npractices</li>\n</ul>\n</li>\n</ul>\n<h2>Document Templating and Management Portal Revamp</h2>\n<ul>\n<li><strong>Context &#x26; Problem:</strong> The company's core revenue stream from insurance\nproducts is directly tied to the variety and extensibility of documents we can\ngenerate. The document support team, responsible for creating and maintaining\nthese templates, was hampered by a slow, unintuitive internal UI with a\nlimited feature set. Critical processes, like creating test quotes for\ndocument validation, were manual and took over 10 minutes per document,\ncreating a significant bottleneck.</li>\n<li><strong>Leadership &#x26; Initiative:</strong>\n<ul>\n<li>I spearheaded an initiative to completely revamp this internal management\nportal, with the primary goal of boosting the doc support team's\nproductivity.</li>\n<li>I drove the project from conception to delivery, coordinating with product,\nbusiness, and cross-functional engineering teams to define clear\nrequirements and align on project goals.</li>\n<li>I established key performance indicators (KPIs) and a process for gathering\ncontinuous user feedback to ensure the new tool met user needs and delivered\nmeasurable improvements.</li>\n</ul>\n</li>\n<li><strong>Execution &#x26; Impact:</strong>\n<ul>\n<li>I led the design and implementation of a new, modern frontend that automated\npreviously manual workflows and introduced a much wider feature set.</li>\n<li>By applying best practices in UX/UI and running experiments on different\nuser flows, the new tool provides a more intuitive and efficient experience.</li>\n<li>This initiative directly addressed a major operational bottleneck,\nempowering the document support team to work more effectively. This, in\nturn, allows Coalition to increase the variety and volume of insurance\nproducts we can offer, directly supporting a key company growth objective.</li>\n</ul>\n</li>\n</ul>\n<h1><strong>Collaboration &#x26; Mentorship</strong></h1>\n<h2><strong>Collaboration</strong></h2>\n<h3></h3>\n<h3><strong>Mentorship and Co-Contributor Role in Design Docs</strong></h3>\n<ul>\n<li></li>\n</ul>\n<h3>Cross-Team Technical Leadership</h3>\n<ul>\n<li>Tech E&#x26;O Project Leadership:\n<ul>\n<li>Created a comprehensive initial design document</li>\n<li>Demonstrated adaptability by pivoting based on senior principal engineer\nfeedback</li>\n<li>Developed and presented multiple architectural options with clear trade-offs</li>\n<li>Successfully integrated with exec-risks-backend despite architectural\ndifferences</li>\n<li>Led proto file centralization initiative across multiple services</li>\n<li>Completed complex refactoring work in external team repositories</li>\n<li>Facilitated smooth handoff to exec-risks team under tight deadlines</li>\n</ul>\n</li>\n</ul>\n<h3></h3>\n<h3><strong>General Recognition</strong></h3>\n<ul>\n<li></li>\n</ul>\n<h3></h3>\n<h2>Foundational Code</h2>\n<h3><strong>Refactoring and Documentation</strong></h3>\n<ul>\n<li></li>\n</ul>\n<h3>Infrastructure and Developer Experience</h3>\n<ul>\n<li>Improved repository documentation and developer onboarding:\n<ul>\n<li>Enhanced READMEs with comprehensive documentation</li>\n<li>Optimized makefile commands for better workflow efficiency</li>\n<li></li>\n</ul>\n</li>\n</ul>\n<h1><strong>Design &#x26; Documentation</strong></h1>\n<h2>Design Docs</h2>\n<ol>\n<li></li>\n</ol>\n<h2>Documentation</h2>\n<ol>\n<li>Heavily improved READMEs in all repos owned</li>\n</ol>\n<h1><strong>What you learned</strong></h1>\n<h2>Concepts and Books</h2>\n<p>Read several books:</p>\n<ul>\n<li></li>\n</ul>\n<p>Concepts:</p>\n<ul>\n<li></li>\n</ul>\n<h2>Libraries and Tools</h2>\n<ul>\n<li></li>\n</ul>\n<h1><strong>Outside of work</strong></h1>\n<h2>Blog posts</h2>\n"}},"__N_SSG":true}