{"pageProps":{"postData":{"id":"brag_doc_template","contentHtml":"<h1><a href=\"https://jvns.ca/blog/brag-documents/#template\">B<strong>rag Document Template</strong></a></h1>\n<h2>Intro</h2>\n<p>Here’s a template for a brag document! Usually I make one brag document per\nyear. (“Julia’s 2017 brag document”). I think it’s okay to make it quite long /\ncomprehensive – 5-10 pages or more for a year of work doesn’t seem like too much\nto me, especially if you’re including some graphs/charts / screenshots to show\nthe effects of what you did.</p>\n<p>One thing I want to emphasize, for people who don’t like to brag, is – <strong>you\ndon’t have to try to make your work sound better than it is</strong>. Just make it\nsound <strong>exactly as good as it is</strong>! For example “was the primary contributor to\nX new feature that’s now used by 60% of our customers and has gotten Y positive\nfeedback”.</p>\n<h2><strong>General prompts</strong></h2>\n<p>If you’re feeling stuck for things to mention, try:</p>\n<ul>\n<li>If you were trying to convince a friend to come join your company/team, what\nwould you tell them about your work?</li>\n<li>Did anybody tell you that you did something well recently?</li>\n</ul>\n<h2>Template</h2>\n<h3><strong>Goals for this year:</strong></h3>\n<ul>\n<li>List your major goals here! Sharing your goals with your manager &#x26; coworkers\nis really nice because it helps them see how they can support you in\naccomplishing those goals!</li>\n<li>[ ]</li>\n</ul>\n<h3><strong>Goals for next year</strong></h3>\n<ul>\n<li>If it’s getting towards the end of the year, maybe start writing down what you\nthink your goals for next year might be.</li>\n<li>[ ]</li>\n</ul>\n<h3><strong>Projects</strong></h3>\n<p>For each one, go through:</p>\n<ul>\n<li>What your contributions were (did you come up with the design? Which\ncomponents did you build? Was there some useful insight like “wait, we can cut\nscope and do what we want by doing way less work” that you came up with?)</li>\n<li>The impact of the project – who was it for? Are there numbers you can attach\nto it? (saved X dollars? shipped new feature that has helped sell Y big deals?\nImproved performance by X%? Used by X internal users every day?). Did it\nsupport some important non-numeric company goal (required to pass an audit?\nhelped retain an important user?)</li>\n</ul>\n<p>Remember: don’t forget to explain what the results of you work actually were!\nIt’s often important to go back a few months later and fill in what actually\nhappened after you launched the project.</p>\n<h3><strong>Collaboration &#x26; mentorship</strong></h3>\n<p>Examples of things in this category:</p>\n<ul>\n<li>Helping others in an area you’re an expert in (like “other engineers regularly\nask me for one-off help solving weird bugs in their CSS” or “quoting from the\nC standard at just the right moment”)</li>\n<li>Mentoring interns / helping new team members get started</li>\n<li>Writing really clear emails/meeting notes</li>\n<li>Foundational code that other people built on top of</li>\n<li>Improving monitoring / dashboards / on call</li>\n<li>Any code review that you spent a particularly long time on / that you think\nwas especially important</li>\n<li>Important questions you answered (“helped Risha from OTHER_TEAM with a lot of\nquestions related to Y”)</li>\n<li>Mentoring someone on a project (“gave Ben advice from time to time on leading\nhis first big project”)</li>\n<li>Giving an internal talk or workshop</li>\n</ul>\n<h3><strong>Design &#x26; documentation</strong></h3>\n<p>List design docs &#x26; documentation that you worked on</p>\n<ul>\n<li>Design docs: I usually just say “wrote design for X” or “reviewed design for\nX”</li>\n<li>Documentation: maybe briefly explain the goal behind this documentation (for\nexample “we were getting a lot of questions about X, so I documented it and\nnow we can answer the questions more quickly”)</li>\n</ul>\n<h3><strong>Company building</strong></h3>\n<p>This is a category we have at work – it basically means “things you did to help\nthe company overall, not just your project / team”. Some things that go in here:</p>\n<ul>\n<li>Going above &#x26; beyond with interviewing or recruiting (doing campus recruiting,\netc)</li>\n<li>Improving important processes, like the interview process or writing better\nonboarding materials</li>\n</ul>\n<h3><strong>What you learned</strong></h3>\n<p>My friend Julian suggested this section and I think it’s a great idea – try\nlisting important things you learned or skills you’ve acquired recently! Some\nexamples of skills you might be learning or improving:</p>\n<ul>\n<li>how to do performance analysis &#x26; make code run faster</li>\n<li>internals of an important piece of software (like the JVM or Postgres or\nLinux)</li>\n<li>how to use a library (like React)</li>\n<li>how to use an important tool (like the command line or Firefox dev tools)</li>\n<li>about a specific area of programming (like localization or timezones)</li>\n<li>an area like product management / UX design</li>\n<li>how to write a clear design doc</li>\n<li>a new programming language</li>\n</ul>\n<p>It’s really easy to lose track of what skills you’re learning, and usually when\nI reflect on this I realize I learned a lot more than I thought and also notice\nthings that I’m <em>not</em> learning that I wish I was.</p>\n<h3><strong>Outside of work</strong></h3>\n<p>It’s also often useful to track accomplishments outside of work, like:</p>\n<ul>\n<li>blog posts</li>\n<li>talks/panels</li>\n<li>open source work</li>\n<li>Industry recognition</li>\n</ul>\n<p>I think this can be a nice way to highlight how you’re thinking about your\ncareer outside of strictly what you’re doing at work.</p>\n<p>This can also include other non-career-related things you’re proud of, if that\nfeels good to you! Some people like to keep a combined personal + work brag\ndocument.</p>\n"}},"__N_SSG":true}